# NewAreaCreationData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewAreaCreationData Method
Application Class See Also
---
Creates an object which wraps the arguments of Area for batch creation.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaCreationData NewAreaCreationData(
	ViewPlan areaView,
	UV point
)
```

Visual Basic
---
```text
Public Function NewAreaCreationData ( _
	areaView As ViewPlan, _
	point As UV _
) As AreaCreationData
```

Visual C++
---
```text
public:
AreaCreationData^ NewAreaCreationData(
	ViewPlan^ areaView,
	UV^ point
)
```

# ### Parameters
areaView
    Type: Autodesk.Revit.DB..::..ViewPlanThe view of area element.
point
    Type: Autodesk.Revit.DB..::..UVA point which lies in an enclosed region of area boundary where the new area will reside.
# ### Return Value
The object containing the data needed for area creation.
# See Also
Application Class
Autodesk.Revit.Creation Namespace